app/views/foodplaces/show.html.erb

  <ul>
    <% @foodplace.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."foodplace_id" = $1  [["foodplace_id", 2]]