app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.foodplace = @foodplace
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("title", "body", "score", "user_id", "foodplace_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "casca"], ["body", "acsac"], ["score", 1.0], ["user_id", 1], ["foodplace_id", 3], ["created_at", "2019-10-18 20:56:41.563060"], ["updated_at", "2019-10-18 20:56:41.563060"]]

    def set_foodplace
      @foodplace = Foodplace.find(params[:foodplace_id])
---
SELECT  "foodplaces".* FROM "foodplaces" WHERE "foodplaces"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]