app/controllers/foodplaces_controller.rb

SELECT "foodplaces".* FROM "foodplaces"
---
  def index
    @foodplaces = Foodplace.all

INSERT INTO "foodplaces" ("name", "email", "address", "score", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "dasd"], ["email", "asda@uc.cl"], ["address", "asd"], ["score", 1.0], ["phone", "adsd"], ["created_at", "2019-10-18 19:41:18.246299"], ["updated_at", "2019-10-18 19:41:18.246299"]]
---
  def create
    @foodplace = Foodplace.new(foodplace_params)

    respond_to do |format|
      if @foodplace.save

DELETE FROM "foodplaces" WHERE "foodplaces"."id" = $1  [["id", 1]]
---
  def destroy
    @foodplace.destroy

SELECT  "foodplaces".* FROM "foodplaces" WHERE "foodplaces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_foodplace
      @foodplace = Foodplace.find(params[:id])